
Процедура СформироватьМанифест(Знач ИмяФайла) Экспорт
	
	Если СоздаватьCFU Тогда
		//TODO: сделать макет для CFU
		ВызватьИсключение "Не реализовано";
	Иначе
		Документ = ПолучитьМакет("МакетМанифеста");
	КонецЕсли;
	
	ЗаполнитьДокумент(Документ);
	СохранитьДокумент(Документ, ИмяФайла);
	
КонецПроцедуры

Процедура ЗаполнитьДокумент(Знач ТекстовыйДокумент)
	
	НужныеСвойства = Новый Структура;
	НужныеСвойства.Вставить("Поставщик", Метаданные.Поставщик);
	НужныеСвойства.Вставить("ИмяСистемы", Метаданные.Имя);
	НужныеСвойства.Вставить("КраткоеИмяСистемы");
	НужныеСвойства.Вставить("КаталогШаблоновПоставщика");
	
	ЗаполнитьЗначенияСвойств(НужныеСвойства, ЭтотОбъект);
	ТекстДокумента = ТекстовыйДокумент.ПолучитьТекст();
	Для Каждого Замена Из НужныеСвойства Цикл
		ЗначениеЗамены = СтрЗаменить(Замена.Значение, """", """""");
		ТекстДокумента = СтрЗаменить(ТекстДокумента, "["+Замена.Ключ+"]", ЗначениеЗамены);
	КонецЦикла;
	
	ТекстовыйДокумент.УстановитьТекст(ТекстДокумента);
	
КонецПроцедуры

Процедура СохранитьДокумент(Знач Документ, Знач ИмяФайла)
	
	Документ.Записать(ИмяФайла);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПустаяСтрока(Метаданные.Поставщик) Тогда
		Сообщить("В метаданных конфигурации не заполнено поле ""Поставщик"". Создание дистрибутива будет невозможно.");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
